==============================================================================
Attribute - asset
==============================================================================

asset foo = @./path/to.jpg@

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (asset_path)))

==============================================================================
Attribute - asset[]
==============================================================================

asset[] foo = [@./path/to.jpg@, @/blah.txt@]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (asset_path)
      (asset_path))))

==============================================================================
Attribute - bool
==============================================================================

bool foo = 1

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - bool[]
==============================================================================

bool[] foo = [1, 0, 1]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - double, negative
==============================================================================

double foo = -123121.12313214

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - double zero, negative
==============================================================================

double foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - double zero, positive
==============================================================================

double foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - float zero, negative
==============================================================================

float foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - float zero, positive
==============================================================================

float foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - half
==============================================================================

half foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - half[]
==============================================================================

half[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - int
==============================================================================

int foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - int[]
==============================================================================

int[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - int64
==============================================================================

int64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - int64[]
==============================================================================

int64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - string
==============================================================================

string foo = "something"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (string)))

==============================================================================
Attribute - string[]
==============================================================================

string[] foo = ["something", "stuff", "", "123"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (string)
      (string)
      (string)
      (string))))

==============================================================================
Attribute - timecode
==============================================================================

timecode time = 1.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - timecode[]
==============================================================================

timecode[] time = [1.0, 10.0, -20.3]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (float)
      (float)
      (float))))

==============================================================================
Attribute - token
==============================================================================

token purpose = "default"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (string)))

==============================================================================
Attribute - token[]
==============================================================================

token[] purpose = ["default", "render"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (string)
      (string))))

==============================================================================
Attribute - uchar
==============================================================================

uchar foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - uchar[]
==============================================================================

uchar[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - uint
==============================================================================

uint foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - uint[]
==============================================================================

uint[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))

==============================================================================
Attribute - uint64
==============================================================================

uint64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (integer)))

==============================================================================
Attribute - uint64[]
==============================================================================

uint64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (integer)
      (integer)
      (integer))))
