==============================================================================
Attribute - asset
==============================================================================

asset foo = @./path/to.jpg@

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (asset_path)))

==============================================================================
Attribute - asset[]
==============================================================================

asset[] foo = [@./path/to.jpg@, @/blah.txt@]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (asset_path)
      (asset_path))))

==============================================================================
Attribute - bool
==============================================================================

bool foo = 1

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - bool[]
==============================================================================

bool[] foo = [1, 0, 1]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - double, negative
==============================================================================

double foo = -123121.12313214

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - double zero, negative
==============================================================================

double foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - double zero, positive
==============================================================================

double foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - float zero, negative
==============================================================================

float foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - float zero, positive
==============================================================================

float foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - half
==============================================================================

half foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - half[]
==============================================================================

half[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - int
==============================================================================

int foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - int[]
==============================================================================

int[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - int64
==============================================================================

int64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - int64[]
==============================================================================

int64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - string
==============================================================================

string foo = "something"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (string_literal)))

==============================================================================
Attribute - string[]
==============================================================================

string[] foo = ["something", "stuff", "", "123"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (string_literal)
      (string_literal)
      (string_literal)
      (string_literal))))

==============================================================================
Attribute - timecode
==============================================================================

timecode time = 1.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - timecode[]
==============================================================================

timecode[] time = [1.0, 10.0, -20.3]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - token
==============================================================================

token purpose = "default"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (string_literal)))

==============================================================================
Attribute - token[]
==============================================================================

token[] purpose = ["default", "render"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (string_literal)
      (string_literal))))

==============================================================================
Attribute - uchar
==============================================================================

uchar foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - uchar[]
==============================================================================

uchar[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - uint
==============================================================================

uint foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - uint[]
==============================================================================

uint[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - uint64
==============================================================================

uint64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (digit)))

==============================================================================
Attribute - uint64[]
==============================================================================

uint64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))


==============================================================================
Attribute - custom attribute
==============================================================================

custom float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (identifier)
    (digit)))

==============================================================================
Attribute - custom uniform attribute
==============================================================================

custom uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (uniform)
    (identifier)
    (digit)))

==============================================================================
Attribute - uniform attribute
==============================================================================

uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (uniform)
    (identifier)
    (digit)))

==============================================================================
Attribute - timeSamples empty
==============================================================================

float value.timeSamples = {}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (timeSamples)))

==============================================================================
Attribute - timeSamples single
==============================================================================

float value.timeSamples = {
  10: 201,
}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (timeSamples
      (digit)
      (digit))))

==============================================================================
Attribute - timeSamples multiple
==============================================================================

float value.timeSamples = {
  -414: 14.4
  10: 201.0,
  10.123: 201.0123,
}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (identifier)
    (timeSamples
      (digit)
      (digit)
      (digit)
      (digit)
      (digit)
      (digit))))

==============================================================================
Simple Attribute definition
==============================================================================

#usda 1.0

def Scope "Prim"
{
    int value = 8
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
	(identifier)
	(digit)))))
