==============================================================================
Attribute declarations
==============================================================================

class "ParamsAPI"
{
    double params:mass (
        doc = "Double value denoting mass"
    )
    double params:velocity (
        doc = "Double value denoting velocity"
    )
    double params:volume (
        doc = "Double value denoting volume"
    )
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block
      (attribute_declaration
        (attribute_type)
        (identifier)
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal))))
      (attribute_declaration
        (attribute_type)
        (identifier)
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal))))
      (attribute_declaration
        (attribute_type)
        (identifier)
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal)))))))

==============================================================================
Attribute - None
==============================================================================

float thing = None

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (None)))


==============================================================================
Prim - over - empty
==============================================================================

over "thing" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block)))

==============================================================================
Prim - over - empty, with a schema
==============================================================================

over Scope "thing" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block)))

==============================================================================
Prim with metadata
==============================================================================

def Scope "something" (
    kind = "component"
)
{
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (metadata
      (metadata_assignment
        (identifier)
        (string_literal)))
    (block)))

==============================================================================
Prim with block + metadata
==============================================================================

def Scope "something" (
    kind = "component"
)
{
    custom int value = 8
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (metadata
      (metadata_assignment
        (identifier)
        (string_literal)))
    (block
      (attribute_assignment
        (custom)
        (attribute_type)
        (identifier)
        (float)))))

==============================================================================
Attribute - custom attribute
==============================================================================

custom float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - custom uniform attribute
==============================================================================

custom uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (uniform)
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Attribute - uniform attribute
==============================================================================

uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (uniform)
    (attribute_type)
    (identifier)
    (float)))

==============================================================================
Simple Attribute definition
==============================================================================

#usda 1.0

def Scope "Prim"
{
    int value = 8
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (float)))))

==============================================================================
Attribute namespace - shader input
==============================================================================

#usda 1.0

def Scope "Prim"
{
    color3f input:value.connect = </some/prim>
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (prim_path)))))

==============================================================================
Attribute nested namespace
==============================================================================

#usda 1.0

def Scope "Prim"
{
    color3f foo:bar:value.connect = </some/prim>
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (prim_path)))))


==============================================================================
Attribute - interpolation metadata
==============================================================================

def "foo"
{
    float[] widths1 = [.5] (interpolation = "constant")
    float[] widths2 = [-.5] (interpolation = "vertex")
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (float))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal))))
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (float))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal)))))))

==============================================================================
Attribute - float bug fix
==============================================================================

def "root"
{
    point3f[] points = [(0, 0, 0), (1, 1, 0), (1, 2, 0), (0, 3, 0), (-1, 4, 0), (-1, 5, 0), (0, 6, 0)]
    float[] widths = [0, .5, .5, .8, .5, .5, 0] (interpolation = "varying")
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))
          (tuple
            (float)
            (float)
            (float))))
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (float)
          (float)
          (float)
          (float)
          (float)
          (float)
          (float))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal)))))))
