==============================================================================
Attribute - asset
==============================================================================

asset foo = @./path/to.jpg@

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (asset_path)))

==============================================================================
Attribute - asset[]
==============================================================================

asset[] foo = [@./path/to.jpg@, @/blah.txt@]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (asset_path)
      (asset_path))))

==============================================================================
Attribute - bool
==============================================================================

bool foo = 1

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - bool[]
==============================================================================

bool[] foo = [1, 0, 1]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - double, negative
==============================================================================

double foo = -123121.12313214

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - double zero, negative
==============================================================================

double foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - double zero, positive
==============================================================================

double foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - float zero, negative
==============================================================================

float foo = -0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - float zero, positive
==============================================================================

float foo = 0.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - half
==============================================================================

half foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - half[]
==============================================================================

half[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - int
==============================================================================

int foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - int[]
==============================================================================

int[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - int64
==============================================================================

int64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - int64[]
==============================================================================

int64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - string
==============================================================================

string foo = "something"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (string_literal)))

==============================================================================
Attribute - string[]
==============================================================================

string[] foo = ["something", "stuff", "", "123"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (string_literal)
      (string_literal)
      (string_literal)
      (string_literal))))

==============================================================================
Attribute - timecode
==============================================================================

timecode time = 1.0

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - timecode[]
==============================================================================

timecode[] time = [1.0, 10.0, -20.3]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - token
==============================================================================

token purpose = "default"

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (string_literal)))

==============================================================================
Attribute - token[]
==============================================================================

token[] purpose = ["default", "render"]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (string_literal)
      (string_literal))))

==============================================================================
Attribute - uchar
==============================================================================

uchar foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - uchar[]
==============================================================================

uchar[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - uint
==============================================================================

uint foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - uint[]
==============================================================================

uint[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))

==============================================================================
Attribute - uint64
==============================================================================

uint64 foo = 2

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - uint64[]
==============================================================================

uint64[] foo = [2, 1, 2]

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (list
      (digit)
      (digit)
      (digit))))


==============================================================================
Attribute - custom attribute
==============================================================================

custom float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - custom uniform attribute
==============================================================================

custom uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (custom)
    (uniform)
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - uniform attribute
==============================================================================

uniform float value = 10.31231424141

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (uniform)
    (attribute_type)
    (identifier)
    (digit)))

==============================================================================
Attribute - timeSamples empty
==============================================================================

float value.timeSamples = {}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (timeSamples)))

==============================================================================
Attribute - timeSamples single
==============================================================================

float value.timeSamples = {
  10: 201,
}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (timeSamples
      (digit)
      (digit))))

==============================================================================
Attribute - timeSamples multiple
==============================================================================

float value.timeSamples = {
  -414: 14.4
  10: 201.0,
  10.123: 201.0123,
}

------------------------------------------------------------------------------

(module
  (attribute_assignment
    (attribute_type)
    (identifier)
    (timeSamples
      (digit)
      (digit)
      (digit)
      (digit)
      (digit)
      (digit))))

==============================================================================
Simple Attribute definition
==============================================================================

#usda 1.0

def Scope "Prim"
{
    int value = 8
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (digit)))))

==============================================================================
Attribute namespace - shader input
==============================================================================

#usda 1.0

def Scope "Prim"
{
    color3f input:value.connect = </some/prim>
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (prim_path)))))

==============================================================================
Attribute nested namespace
==============================================================================

#usda 1.0

def Scope "Prim"
{
    color3f foo:bar:value.connect = </some/prim>
}

------------------------------------------------------------------------------

(module
  (comment)
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (prim_path)))))


==============================================================================
Attribute - interpolation metadata
==============================================================================

def "foo"
{
    float[] widths1 = [.5] (interpolation = "constant")
    float[] widths2 = [-.5] (interpolation = "vertex")
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (digit))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal))))
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (digit))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal)))))))

==============================================================================
Attribute - float bug fix
==============================================================================

def "root"
{
    point3f[] points = [(0, 0, 0), (1, 1, 0), (1, 2, 0), (0, 3, 0), (-1, 4, 0), (-1, 5, 0), (0, 6, 0)]
    float[] widths = [0, .5, .5, .8, .5, .5, 0] (interpolation = "varying")
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))
          (tuple
            (digit)
            (digit)
            (digit))))
      (attribute_assignment
        (attribute_type)
        (identifier)
        (list
          (digit)
          (digit)
          (digit)
          (digit)
          (digit)
          (digit)
          (digit))
        (metadata
          (metadata_assignment
            (identifier)
            (string_literal)))))))
