==============================================================================
Prim - def - empty
==============================================================================

def "root" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block)))

==============================================================================
Prim - def - empty, with a schema
==============================================================================

def Scope "root" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block)))

==============================================================================
Prim - class - empty, with a schema
==============================================================================

class Scope "thing" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block)))

==============================================================================
Prim - over - empty
==============================================================================

over "thing" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (string_literal)
    (block)))

==============================================================================
Prim - over - empty, with a schema
==============================================================================

over Scope "thing" {}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (block)))

==============================================================================
Prim with metadata
==============================================================================

def Scope "something" (
    kind = "component"
)
{
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (metadata
      (metadata_assignment
        (identifier)
        (string_literal)))
    (block)))

==============================================================================
Prim with block + metadata
==============================================================================

def Scope "something" (
    kind = "component"
)
{
    custom int value = 8
}

------------------------------------------------------------------------------

(module
  (prim_definition
    (prim_type)
    (identifier)
    (string_literal)
    (metadata
      (metadata_assignment
        (identifier)
        (string_literal)))
    (block
      (attribute_assignment
        (custom)
        (identifier)
        (digit)))))
